<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"ca09df910727e1f60b9171e3e48827f78423435260df13f4efb538aca46aee5d","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #642 at https://github.com/cal-itp/data-infra/actions/runs/17806074609","plan_out_hash":"ce14d0ebee6c5d17ee37dde15ea316524e54c6c14b6925e8f48b5f2916735624","plan_hash":"98e128721e58247b9545aa6e68ce62c1a4c76d702bbfc307c38482e77f9ffffb","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["plugins/operators/gcs_to_gtfs_rt_command_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "Wa3d7A==" -> (known after apply)
!~      detect_md5hash      = "X1vzI+Igw4CNM/UbpH2o8A==" -> "different hash"
!~      generation          = 1757464207505005 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/gcs_to_gtfs_rt_command_operator.py"
!~      md5hash             = "X1vzI+Igw4CNM/UbpH2o8A==" -> (known after apply)
        name                = "plugins/operators/gcs_to_gtfs_rt_command_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "Tev42g==" -> (known after apply)
!~      detect_md5hash      = "WH9/csQm9d1jFHYJ9tDp6w==" -> "different hash"
!~      generation          = 1757541552203979 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "WH9/csQm9d1jFHYJ9tDp6w==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "0PcBgA==" -> (known after apply)
!~      detect_md5hash      = "TuukowzlGluvU+BnYGmOkA==" -> "different hash"
!~      generation          = 1757541553964048 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "TuukowzlGluvU+BnYGmOkA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #642](https://github.com/cal-itp/data-infra/actions/runs/17806074609)